src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/СтатьиАктивовПассивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиАктивовПассивов</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Партнеры</types>
    <types>EnumRef.ТипыНалогов</types>
    <types>CatalogRef.ПрочиеАктивыПассивы</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.Склады</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДебиторскаяЗадолженность</name>
      <description>Дебиторская задолженность</description>
      <code>УТ-00000023</code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>УТ-00000020</code>
    </items>
    <items>
      <name>ДепонированнаяЗарплата</name>
      <description>Депонированная зарплата</description>
      <code>УТ-00000032</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>ИмущественныеНалоги</name>
      <description>Имущественные налоги</description>
      <code>УТ-00000034</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>КредиторскаяЗадолженность</name>
      <description>Кредиторская задолженность</description>
      <code>УТ-00000024</code>
    </items>
    <items>
      <name>Налоги</name>
      <description>Налоги</description>
      <code>УТ-00000035</code>
      <type>
        <types>EnumRef.ТипыНалогов</types>
      </type>
    </items>
    <items>
      <name>НалогиИВзносыСОплатыТруда</name>
      <description>Налоги и взносы с оплаты труда</description>
      <code>УТ-00000031</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>НезавершенноеПроизводство</name>
      <description>Незавершенное производство</description>
      <code>УТ-00000029</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ОплатаТруда</name>
      <description>Оплата труда</description>
      <code>УТ-00000030</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ПредметыЛизинга</name>
      <description>Предметы лизинга</description>
      <code>УТ-00000033</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
        <types>CatalogRef.НаправленияДеятельности</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>УТ-00000016</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>ПрочиеАктивы</name>
      <description>Прочие активы</description>
      <code>УТ-00000012</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>ПрочиеПассивы</name>
      <description>Прочие пассивы</description>
      <code>УТ-00000013</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>УТ-00000015</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>РасходыТекущегоПериода</name>
      <description>Расходы текущего периода</description>
      <code>УТ-00000014</code>
      <type>
        <types>CatalogRef.ПрочиеАктивыПассивы</types>
      </type>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>УТ-00000027</code>
    </items>
    <items>
      <name>ЦелевоеФинансирование</name>
      <description>Целевое финансирование</description>
      <code>УТ-00000036</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктивПассив</name>
    <type>
      <types>EnumRef.ВидыСтатейУправленческогоБаланса</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/Enums/ВидыСтатейУправленческогоБаланса/ВидыСтатейУправленческогоБаланса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатейУправленческогоБаланса</name>
  <enumValues>
    <name>Актив</name>
  </enumValues>
  <enumValues>
    <name>Пассив</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCharacteristicTypes/СтатьиАктивовПассивов/Forms/ФормаВыбораСтатьиИАналитики/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("АктивПассив") Тогда
		ПризнакАктивПассив = Параметры.АктивПассив;
		Если ПризнакАктивПассив = Перечисления.ВидыСтатейУправленческогоБаланса.Актив Тогда
			Элементы.Статья.Заголовок = НСтр("ru='Статья активов';uk='Стаття активів'");
			Заголовок = НСтр("ru='Выбор статьи активов и аналитики';uk='Вибір статті активів та аналітики'");
		Иначе
			Элементы.Статья.Заголовок = НСтр("ru='Статья пассивов';uk='Стаття пасивів'");
			Заголовок = НСтр("ru='Выбор статьи пассивов и аналитики';uk='Вибір статті пасивів та аналітики'");
		КонецЕсли;
		
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.АктивПассив", Параметры.АктивПассив);
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(ПараметрВыбора);
		Элементы.Статья.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	Иначе
		Заголовок = НСтр("ru='Выбор статьи и аналитики';uk='Вибір статті та аналітики'");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Параметр = Новый Структура("Статья, Аналитика", СтатьяАктивовПассивов, АналитикаАктивовПассивов);
		Закрыть(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
